ERP/src/InformationRegisters/ИсторияИзмененияТарифаПодписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияТарифаПодписки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тариф</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазоваяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегулярногоПлатежа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Подписка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/InformationRegisters/ИсторияИзмененияТарифаПодписки/Ext/ManagerModule.bsl
Процедура ОбновитьДанные(Подписка, Тариф, БазоваяСтоимость, СуммаРегулярногоПлатежа) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Подписка = Подписка;
	МенеджерЗаписи.Тариф = Тариф;
	МенеджерЗаписи.БазоваяСтоимость = БазоваяСтоимость;
	МенеджерЗаписи.СуммаРегулярногоПлатежа = СуммаРегулярногоПлатежа;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
